.name "Queen of zorks"
.comment "Come to me, my kids!"


# код породжених юнітів
#add r14, r15, r16
#0454 0e0f 10

#live 	%-1
#01 ffff ffff

#zjmp %-21
#09ff eb


add r14, r15, r16
live 	%-1

#початкова позиція для породженого юніту
ld %122, r13

#значення, на яке буде збільнуватись позиція на кожному циклі
ld %42, r11

#зміщення каретки для fork
ld %0, r8

#зміщення каретки для fork
ld %65446, r12

# 1. Pаписуємо його в регістри каретки
# 1.1 Запис команди add r14, r15, r16
	ld %1108, r2
	ld %921360, r3
# 1.2 Запис команди live %номер поточного гравця в регістри
	ld %1, r4
	ld %4294967295, r5
# 1.3 Запис команди zjmp %-21
	ld %9, r6
	ld %65515, r7
# 1.4 Запис команди fork %35 (0c00 23)
	ld %12, r9
	ld %35, r10

	sti r10, %0, %125
	sti r9, %0, %116
	sti r16, %0, %115
	sti r12, %0, %114
	sti r6, %0, %105

# 2. Тут цикл основного гравця
# 2.1 Беремо код з регістрів і записуємо на карту
#	запис add r14, r15, r16

    sti r2, r13, %0
	sti r3, r13, %-2
#	запис live %-1
	sti r4, r13, %-4
	sti r5, r13, %-6
#	запис add r14, r15, r16
	sti r2, r13, %-8
	sti r3, r13, %-10
#	запис zjmp %-10
	sti r16, r13, %-12
	sti r7, r13, %-12
	sti r6, r13, %-20
# 2.3 Каретка сигналізує що жива, бо буде знищена
	live 	%-1
# 2.4 Змінюємо позицію в яку буде скопійований код наступного разу
	add r13, r11, r13
	add r8, r11, r8
	add r14, r15, r16
	sti r8, %0, %16
	sti r9, %0, %7

# 2.2 Створюємо нову каретку в позиції скопійованого коду
	# fork %30
	# sti r10, %40, %-8
	# sti r9, %40, %0
# 2.5 Перестрибуємо на початок циклу
#	zjmp %-75
